# ------------------------------------------
# Ultimate Developer Brewfile
# ------------------------------------------

# Essential CLI Tools
brew "git"                # Version control system
brew "lazygit"            # Simple terminal UI for git commands
brew "wget"               # Utility to download files from the web
brew "curl"               # Command-line tool for transferring data
brew "neovim"             # Modern, fast, and extensible Vim alternative
brew "tmux"               # Terminal multiplexer for managing multiple sessions
brew "tree"               # Display directory structure in a tree format
brew "htop"               # Interactive system process viewer
brew "jq"                 # Command-line JSON processor
brew "fd"                 # Fast and user-friendly alternative to `find`
brew "ripgrep"            # Fast and recursive grep alternative
brew "bat"                # Enhanced `cat` with syntax highlighting
brew "fzf"                # Fuzzy file finder for command-line usage
brew "zsh"                # Z shell for improved shell features
brew "zsh-autosuggestions" # Suggests commands based on history
brew "zsh-syntax-highlighting" # Improves command visibility in Zsh
brew "thefuck"            # Corrects previous command mistakes
brew "tldr"               # Concise community-driven man pages
brew "gh"                 # GitHub command-line interface
brew "mas"                # Mac App Store command-line interface
brew "asciiquarium"       # ASCII aquarium display
brew "neofetch"           # System information in ASCII format
brew "lolcat"             # Displays colored text in terminal

# Install Xcode from the Mac App Store
mas "Xcode", id: 497799835

# Programming Languages & Runtimes
brew "python"            # Python 3 programming language
brew "node"              # Node.js runtime with npm
brew "nvm"               # Node Version Manager for managing Node.js versions
brew "openjdk"           # Java Development Kit (JDK)
brew "pyenv"             # Python version management tool

# DevOps & Cloud Tools
brew "awscli"            # AWS Command Line Interface
brew "azure-cli"         # Azure Command Line Interface
brew "terraform"         # Infrastructure as Code tool

# Frontend Development Tools
brew "yarn"              # JavaScript package manager
brew "eslint"            # JavaScript linter to ensure code quality
brew "prettier"          # Code formatter for JavaScript and other languages

# Containers & Virtualization
brew "docker"            # Containerization platform

# Development & Productivity Enhancements
brew "powerlevel10k"     # Fast and customizable Zsh theme

